The Detail Level.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ViewDetailLevel DetailLevel { get; }
  Visual Basic
Public ReadOnly Property DetailLevel As ViewDetailLevel
	Get
  Visual C++
public:
property ViewDetailLevel DetailLevel {
	ViewDetailLevel get ();
}
 See Also
  OverrideGraphicSettings Class
  Autodesk.Revit.DB Namespace